disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
/* ==========================================================
 * sx126x_hal.c - implementation for sigfox library, board api
 * ----------------------------------------------------------
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU LESSER General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Lesser Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 * ---------------------------------------------------------
 *
 *  Created on: 11 june 2024
 *      Author: Paul Pinault
 * ----------------------------------------------------------
 * Copyright : Paul Pinault aka Disk91 2024
 * ==========================================================
 */
#include <it_sdk/config.h>
#if ITSDK_WITH_SIGFOX_LIB == __ENABLE && ITSDK_SIGFOX_LIB == __SIGFOX_SX126X

#include <drivers/sx126x/sigfox_sx126x.h>
#ifdef USE_SIGFOX_EP_FLAGS_H
  #include "sigfox_ep_flags.h" // 3rdParties/sigfox/sigfox-ep-lib/inc/sigfox_ep_flags.h
#endif
#include "sx126x_hal.h"
#include "sigfox_types.h"
#include "board/sx126x_hw_api.h"
#include "sigfox_error.h"
#include "sx126x.h"

#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0
  #include "stm32wlxx_hal_subghz.h"
  HAL_StatusTypeDef SUBGHZSPI_Transmit(SUBGHZ_HandleTypeDef *hsubghz, uint8_t Data);
  HAL_StatusTypeDef SUBGHZSPI_Receive(SUBGHZ_HandleTypeDef *hsubghz, uint8_t *pData);
  HAL_StatusTypeDef SUBGHZ_WaitOnBusy(SUBGHZ_HandleTypeDef *hsubghz);
  HAL_StatusTypeDef SUBGHZ_CheckDeviceReady(SUBGHZ_HandleTypeDef *hsubghz);
#endif

// ----------------------------------------------------------------------
// HELPERS
// ----------------------------------------------------------------------
#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) == 0
void __sx126x_spi_nss_select() {
	#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
		gpio_set(ITSDK_SFX_SX126X_CS_BANK,ITSDK_SFX_SX126X_CS_PIN);
	#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
		gpio_reset(ITSDK_SFX_SX126X_CSDN_BANK,ITSDK_SFX_SX126X_CSDN_PIN);
	#else
		#warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
	#endif
}

void __sx126x_spi_nss_unselect() {
	#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
		gpio_reset(ITSDK_SFX_SX126X_CS_BANK,ITSDK_SFX_SX126X_CS_PIN);
	#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
		gpio_set(ITSDK_SFX_SX126X_CSDN_BANK,ITSDK_SFX_SX126X_CSDN_PIN);
	#else
		#warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
	#endif
}
#endif

// ============================================================
// sx126x_eplib_api.c
// ============================================================


// ----------------------------------------------------------------------
// This function is called to reconfigure the board after a wake-up event
// The hal_wakeup is called right after, don't duplicate actions
// The context parameter is SFX_NULL
// Concretly this function is call on every send message
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_reset( const void* context )
{
    SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_reset\r\n"));

	#ifdef ERROR_CODES
	 SX126X_HW_API_status_t status = SX126X_HAL_STATUS_OK;
	#endif

	// Configure the pin for Chip Select
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) == 0
		#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CS_BANK, ITSDK_SFX_SX126X_CS_PIN, GPIO_OUTPUT_PP );
	     gpio_reset(ITSDK_SFX_SX126X_CS_BANK,ITSDK_SFX_SX126X_CS_PIN);
		#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CSDN_BANK, ITSDK_SFX_SX126X_CSDN_PIN, GPIO_OUTPUT_PP );
		 gpio_set(ITSDK_SFX_SX126X_CSDN_BANK,ITSDK_SFX_SX126X_CSDN_PIN);
		#else
		  #warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
		#endif
	#endif

	// Configure the pin used for RFSwitch
	if ( ITSDK_SFX_SX126X_RFSW1_PIN != __LP_GPIO_NONE ) {
		gpio_configure_ext(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN,GPIO_OUTPUT_PP, ITSDK_GPIO_SPEED_HIGH, ITSDK_GPIO_ALT_NONE);
		gpio_reset(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
	}
	if ( ITSDK_SFX_SX126X_RFSW2_PIN != __LP_GPIO_NONE ) {
		gpio_configure_ext(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN,GPIO_OUTPUT_PP, ITSDK_GPIO_SPEED_HIGH, ITSDK_GPIO_ALT_NONE);
		gpio_reset(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
	}


	// Configure the interruption handler and SPI
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

		ITSDK_SFX_SX126X_SPI.Init.BaudratePrescaler = SUBGHZSPI_BAUDRATEPRESCALER_8;
		HAL_StatusTypeDef r = HAL_SUBGHZ_Init(&ITSDK_SFX_SX126X_SPI);
	    if (r != HAL_OK) {
		  #ifdef ERROR_CODES
	    	status = SX126X_HW_API_ERROR;
		  #endif
	      LOG_DEBUG_SFXSX126X(("[SX] Failed to init subghz %d\r\n",r));
	      RETURN();
	    }

		__HAL_RCC_SUBGHZSPI_CLK_ENABLE();
		HAL_NVIC_SetPriority(SUBGHZ_Radio_IRQn, 0, 0);
		HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);

	#else
		if ( ITSDK_SFX_IRQ_PIN != __LP_GPIO_NONE ) {
			gpio_interruptClear(ITSDK_SFX_IRQ_BANK, ITSDK_SFX_IRQ_PIN);
			gpio_configure(ITSDK_SFX_IRQ_BANK, ITSDK_SFX_IRQ_PIN, GPIO_INTERRUPT_RISING );
			gpio_interruptPriority(ITSDK_SFX_IRQ_BANK,ITSDK_SFX_IRQ_PIN,0,0);
			gpio_registerIrqAction(&__sx1262_irq);
			gpio_interruptEnable(ITSDK_SFX_IRQ_BANK, ITSDK_SFX_IRQ_PIN);
		}
	#endif


    return status;
}

// ----------------------------------------------------------------------
// This function is called to reconfigure the board after a wake-up event
// The context parameter is SFX_NULL
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_wakeup( const void* context )
{
	SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_wakeup\r\n"));
    return SX126X_HAL_STATUS_OK;
}

// ----------------------------------------------------------------------
// Transfer the data to the SPI driver
// Context is unused, make a SPI transfer of the command
// Send a byte stream composed by command & data field on the SPI
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_write( const void* context, const uint8_t* command, const uint16_t command_length,
                                      const uint8_t* data, const uint16_t data_length )
{
	SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_write %d %d\r\n",command_length,data_length));

    #if (ITSDK_LOGGER_MODULE & __LOG_MOD_LOWSIGFOX) > 0
    	LOG_DEBUG_SFXSX126X(("[SX]  cmd: "));
		for ( int i = 0 ; i < command_length ; i++ ) {
			LOG_DEBUG_SFXSX126X(("%02X ",command[i]));
		}
		LOG_DEBUG_SFXSX126X(("\r\n"));
    	LOG_DEBUG_SFXSX126X(("[SX]  data: "));
		for ( int i = 0 ; i < data_length ; i++ ) {
			LOG_DEBUG_SFXSX126X(("%02X ",data[i]));
		}
		LOG_DEBUG_SFXSX126X(("\r\n"));
	#endif

	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

