disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
		(void)SUBGHZ_CheckDeviceReady(&ITSDK_SFX_SX126X_SPI);
		LL_PWR_SelectSUBGHZSPI_NSS();

		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Transmit(&ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;

		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Transmit(&ITSDK_SFX_SX126X_SPI, data[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		LL_PWR_UnselectSUBGHZSPI_NSS();
		SUBGHZ_WaitOnBusy(&ITSDK_SFX_SX126X_SPI);

	#else
		#warning "Use of standard SPI driver, never been tested"

		__sx126x_spi_nss_select();
		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r = spi_write_byte(ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;

		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	spi_write_byte(ITSDK_SFX_SX126X_SPI, data[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		__sx126x_spi_nss_unselect();

	#endif


    return SX126X_HAL_STATUS_OK;

failed:
	LOG_ERROR_SFXSX126X(("[SX] sx126x_hal_write - failed %d\r\n",r));
	return SX126X_HAL_STATUS_ERROR;
}

// ----------------------------------------------------------------------
// Read the data from the SPI driver
// Context is unused, make a SPI transfer of the command
// Send a byte stream composed by command & data field on the SPI
// The command sent by the upper layer contains the NOP instruction when required
// ----------------------------------------------------------------------
sx126x_hal_status_t sx126x_hal_read( const void* context, const uint8_t* command, const uint16_t command_length,
                                     uint8_t* data, const uint16_t data_length )

{
	SFX_UNUSED(context);
    LOG_DEBUG_SFXSX126X(("[SX] sx126x_hal_read %d %d\r\n",command_length,data_length));
    LOG_DEBUG_SFXSX126X(("[SX] cmd[0] 0x%02X adr 0x%02X%02X\r\n",command[0],command[1],command[2]));

	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

		(void)SUBGHZ_CheckDeviceReady(&ITSDK_SFX_SX126X_SPI);
		LL_PWR_SelectSUBGHZSPI_NSS();

		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Transmit(&ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;

		// Read data
		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	(_SPI_Status)SUBGHZSPI_Receive(&ITSDK_SFX_SX126X_SPI, &data[i]);
		}

		#if (ITSDK_LOGGER_MODULE & __LOG_MOD_LOWSIGFOX) > 0
			LOG_DEBUG_SFXSX126X(("[SX] resp : "));
			for ( int i = 0 ; i < data_length && r == __SPI_OK ; i++) {
				LOG_DEBUG_SFXSX126X(("%02X ",data[i]));
			}
			LOG_DEBUG_SFXSX126X(("\r\n"));
		#endif

		if ( r != __SPI_OK ) goto failed;

		LL_PWR_UnselectSUBGHZSPI_NSS();
		SUBGHZ_WaitOnBusy(&ITSDK_SFX_SX126X_SPI);

	#else
		#warning "Use of standard SPI driver, never been tested"

		__sx126x_spi_nss_select();
		_SPI_Status r = __SPI_OK;
		for ( int i = 0 ; i < command_length && r == __SPI_OK; i++) {
			r = spi_write_byte(ITSDK_SFX_SX126X_SPI, command[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		// Transmit dummy byte
		r = spi_write_byte(ITSDK_SFX_SX126X_SPI, 0U);
		if ( r != __SPI_OK ) goto failed;

		for ( int i = 0 ; i < data_length && r == __SPI_OK; i++) {
			r =	spi_read_byte(ITSDK_SFX_SX126X_SPI, &data[i]);
		}
		if ( r != __SPI_OK ) goto failed;
		__sx126x_spi_nss_unselect();

	#endif

    return SX126X_HAL_STATUS_OK;

failed:
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0
		LL_PWR_UnselectSUBGHZSPI_NSS();
	#else
		__sx126x_spi_nss_unselect();
	#endif
	LOG_ERROR_SFXSX126X(("[SX] sx126x_hal_read - failed %d\r\n",r));
	return SX126X_HAL_STATUS_ERROR;

}


// ============================================================
// sx126x_hal.c
// ============================================================

// ============================================================
// Override the IRQ handlers
// As Subghz driver already decode and split the different
// interruption we need to regroup them for the sigfox handler
// this avoid to modify the global irq handler and makes integration
// easier
// ============================================================

#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

// the SX126X_RF_API_process callback function is bypassed as the subghz handler already
// split / clear and route the irq to the dedicated handler.
// the other way is to remove the hal sughz handler but it will be override by the cube mx
// regeneration and more complex to explain. Make sure this function is updated if SX126X_RF_API_process callback
// is updated in the future


// Approach #2 - should work
// Override the sx126x_get_and_clear_irq_status to fake the sx registers and return the right status
// function of the previous IRQ handler seen, so internal process function may work normally
// You need to add a function in the sx126x_rf_api.c file
//
//  __attribute__((weak)) sx126x_status_t SX126X_RF_API_get_and_clear_irq_status( const void* context, sx126x_irq_mask_t* irq ) {
// 	  return sx126x_get_and_clear_irq_status(context,irq);
//  }


#define __SX126X_IRQ_CLEARED    0
#define __SX126X_IRQ_TXCOMPLETE	1
#define __SX126X_IRQ_RXCOMPLETE 2
static uint8_t __sx126x_irq_status = __SX126X_IRQ_CLEARED;
static SX126X_HW_irq_cb_t * __sx1262_irq_cb = NULL;
sx126x_status_t SX126X_RF_API_get_and_clear_irq_status( const void* context, sx126x_irq_mask_t* irq ) {

	// override the default function
	if ( __sx126x_irq_status & __SX126X_IRQ_TXCOMPLETE ) *irq |= SX126X_IRQ_TX_DONE;
	if ( __sx126x_irq_status & __SX126X_IRQ_RXCOMPLETE ) *irq |= SX126X_IRQ_RX_DONE;
	__sx126x_irq_status = __SX126X_IRQ_CLEARED;

	#if (ITSDK_LOGGER_MODULE & __LOG_MOD_LOWSIGFOX) > 0
		if ( *irq != 0 ) LOG_DEBUG_SFXSX126X(("[SX] SX126X_RF_API_get_and_clear_irq_status\r\n"));
	#endif

	return SX126X_STATUS_OK;
}


void HAL_SUBGHZ_TxCpltCallback(SUBGHZ_HandleTypeDef *hsubghz) {
	LOG_DEBUG_SFXSX126X(("[SX] HAL_SUBGHZ_TxCpltCallback\r\n"));
	__sx126x_irq_status |= __SX126X_IRQ_TXCOMPLETE;
	if ( __sx1262_irq_cb != NULL ) __sx1262_irq_cb();
}

#ifdef BIDIRECTIONAL

 static volatile itsdk_bool_e __sx126x_dataReceived = BOOL_FALSE;
 void HAL_SUBGHZ_RxCpltCallback(SUBGHZ_HandleTypeDef *hsubghz) {
	LOG_DEBUG_SFXSX126X(("[SX] HAL_SUBGHZ_RxCpltCallback\r\n"));
	__sx126x_irq_status |= __SX126X_IRQ_RXCOMPLETE;
	if ( __sx1262_irq_cb != NULL ) __sx1262_irq_cb();
 }

