disk91/stm32-it-sdk/Src/drivers/sigfox/sx126x_hal.c
 /*
  * Aparently not used, the timeout seems to be fixed at FFFF and
  * managed with a timer.
 void HAL_SUBGHZ_RxTxTimeoutCallback(SUBGHZ_HandleTypeDef *hsubghz) {
	LOG_DEBUG_SFXSX126X(("[SX] HAL_SUBGHZ_RxTxTimeoutCallback\r\n"));
	if ( __sx1262_irq_cb != NULL ) __sx1262_irq_cb();
 }
 */

 #ifndef ASYNCHRONOUS
  itsdk_bool_e sx126x_hasDataReceived() {
	return __sx126x_dataReceived;
  }

  void sx126x_resetDataReceived() {
	__sx126x_dataReceived = BOOL_FALSE;
  }
 #endif // ASYNCHRONOUS

#endif	// BIDIRECTIONAL

// Unused irq handlers
// void HAL_SUBGHZ_PreambleDetectedCallback(SUBGHZ_HandleTypeDef *hsubghz){}
// void HAL_SUBGHZ_SyncWordValidCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
// void HAL_SUBGHZ_HeaderValidCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
// void HAL_SUBGHZ_HeaderErrorCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
// void HAL_SUBGHZ_CRCErrorCallback(SUBGHZ_HandleTypeDef *hsubghz){}
// void HAL_SUBGHZ_CADStatusCallback(SUBGHZ_HandleTypeDef *hsubghz,HAL_SUBGHZ_CadStatusTypeDef cadstatus){}
// void HAL_SUBGHZ_RxTxTimeoutCallback(SUBGHZ_HandleTypeDef *hsubghz){}
// void HAL_SUBGHZ_LrFhssHopCallback(SUBGHZ_HandleTypeDef *hsubghz) {}
#else
  // integration with external irq
  static gpio_irq_chain_t __sx1262_irq;
#endif // (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0



// ============================================================
// Call when sigfox lib is initialized
// Once on lib setup ; hardware init prefered on hal_reset call
// on every frame.
// ============================================================
SX126X_HW_API_status_t SX126X_HW_API_open(SX126X_HW_irq_cb_t callback)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_open\r\n"));

	#ifdef ERROR_CODES
	 SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0
	    __sx1262_irq_cb = callback;
	#else
		__sx1262_irq.irq_func = callback;
		__sx1262_irq.pinMask = ITSDK_SFX_IRQ_PIN;
	#endif

	// nothing bad calling hardware config before the first sigfox send
	sx126x_hal_reset(NULL);

    RETURN();
}

SX126X_HW_API_status_t SX126X_HW_API_close(void)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_close\r\n"));

	// Switch off what we can ...

	// Reduce SMPSEN to 20mA
	uint8_t value;
	HAL_SUBGHZ_ReadRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_SMPSC2R,(uint8_t*)&value);
	value = (value & (~__SX126X_SMPS_DRV_MASK)) | __SX126X_SMPS_DRV_20;
	HAL_SUBGHZ_WriteRegister(&ITSDK_SFX_SX126X_SPI,__SX126X_REG_SMPSC2R,value);


	// Unset the pin for Chip Select
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) == 0
		#if ITSDK_SFX_SX126X_CS_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CS_BANK, ITSDK_SFX_SX126X_CS_PIN, GPIO_OFF );
		#elif ITSDK_SFX_SX126X_CSDN_PIN != __LP_GPIO_NONE
	     gpio_configure(ITSDK_SFX_SX126X_CSDN_BANK, ITSDK_SFX_SX126X_CSDN_PIN, GPIO_OFF );
		#else
		  #warning "You did not setup a CS pin for SX1262 SPI, are you sure ?"
		#endif
	#endif

	// Unset pin used for RFSwitch
	if ( ITSDK_SFX_SX126X_RFSW1_PIN != __LP_GPIO_NONE ) gpio_reset(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN);
	if ( ITSDK_SFX_SX126X_RFSW2_PIN != __LP_GPIO_NONE ) gpio_reset(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN);
	if ( ITSDK_SFX_SX126X_RFSW1_PIN != __LP_GPIO_NONE ) gpio_configure(ITSDK_SFX_SX126X_RFSW1_BANK,ITSDK_SFX_SX126X_RFSW1_PIN,GPIO_OFF);
	if ( ITSDK_SFX_SX126X_RFSW2_PIN != __LP_GPIO_NONE ) gpio_configure(ITSDK_SFX_SX126X_RFSW2_BANK,ITSDK_SFX_SX126X_RFSW2_PIN,GPIO_OFF);

	// disable interrupt
	#if ( (ITSDK_WITH_SPI) & __SPI_SUBGHZ ) > 0

		__HAL_RCC_SUBGHZSPI_CLK_DISABLE();
		HAL_NVIC_DisableIRQ(SUBGHZ_Radio_IRQn);

	#else
		if ( ITSDK_SFX_IRQ_PIN != __LP_GPIO_NONE ) {
			gpio_interruptClear(ITSDK_SFX_IRQ_BANK, ITSDK_SFX_IRQ_PIN);
			gpio_configure(ITSDK_SFX_IRQ_BANK, ITSDK_SFX_IRQ_PIN, GPIO_STOP );
			gpio_removeIrqAction(&__sx1262_irq);
		}
	#endif

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

    RETURN();
}

// ------------------------------------------------------------------
// Wait for the given number of ms
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_delayMs(unsigned short delay_ms)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_delayMs\r\n"));
	itsdk_delayMs(delay_ms);

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

    RETURN();
}

// ------------------------------------------------------------------
// Return the type of semtech module used between 1261 and 1262
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_get_chip_name(SX126X_HW_API_chip_name_t *chipset)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_chip_name\r\n"));
	#if ITSDK_SFX_SX126X_CHIP == __SX1261
	 *chipset = SX126X_HW_API_CHIP_NAME_SX1261;
	#elif ITSDK_SFX_SX126X_CHIP == __SX1262 || ITSDK_SFX_SX126X_CHIP == __E5WL
	 *chipset = SX126X_HW_API_CHIP_NAME_SX1262;
	#else
	 #error "You must select the Semtech core chip version in config file"
	#endif

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}

// ------------------------------------------------------------------
// Return the type of power regulator used DCDC vs LDO
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_get_reg_mode(SX126X_HW_API_reg_mod_t *reg_mode)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_reg_mode\r\n"));

	#if ITSDK_SFX_SX1262_REGULOR == __POWER_LDO
	 *reg_mode = SX126X_HW_API_REG_MODE_LDO;
	#elif ITSDK_SFX_SX1262_REGULOR == __POWER_DCDC
	 *reg_mode = SX126X_HW_API_REG_MODE_DCDC;
	#else
	 #error "You must select the power regulator type in config file"
	#endif


	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif
    RETURN();
}


// ------------------------------------------------------------------
// Return the oscillator configuration
// TCXO powered can be controlled by the SX126x DIO3 pin, in this case,
//  the tcxo_is_radio_controlled is set to 1 else 0. When controlled by
//  sx126x the power voltage can be set with supply_voltage, else this
//  voltage is ignored.
//  The startup_time_in_tick also only used when TCXO controlled by SX126x
// ------------------------------------------------------------------
SX126X_HW_API_status_t SX126X_HW_API_get_xosc_cfg(SX126X_HW_API_xosc_cfg_t *xosc_cfg)
{
	LOG_DEBUG_SFXSX126X(("[SX] SX126X_HW_API_get_xosc_cfg\r\n"));
	#if !defined ITSDK_SFX_SX126X_TCXO_STIKS || !defined ITSDK_SFX_SX126X_TCXO_SXCTL
	  #error "The ITSDK_SFX_SX126X_TCXO_STIKS must be defined"
	#endif

	xosc_cfg->startup_time_in_tick = ITSDK_SFX_SX126X_TCXO_STIKS;
	#if ITSDK_SFX_SX126X_TCXO_SXCTL == __DISABLE
	 xosc_cfg->tcxo_is_radio_controlled = 0;
	#else
	 xosc_cfg->tcxo_is_radio_controlled = 1;
	#endif

	#if ITSDK_SFX_SX126X_TCXO_PWR == 16
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_1_6V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 17
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_1_7V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 18
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_1_8V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 22
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_2_2V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 24
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_2_4V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 27
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_2_7V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 30
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_3_0V;
	#elif ITSDK_SFX_SX126X_TCXO_PWR == 33
		xosc_cfg->supply_voltage = SX126X_HW_API_TCXO_CTRL_3_3V;
	#else
		#error "The ITSDK_SFX_SX126X_TCXO_PWR must be defined"
	#endif

	#ifdef ERROR_CODES
     SX126X_HW_API_status_t status = SX126X_HW_API_SUCCESS;
	#endif

    RETURN();
}

// -----------------------------------------------------------------
// Configure the Rf Switch and the powering based on the
// configuration required
// the way PA is configured can be board specific, so it is
// possible to override this function for specific modules / implementation
// paSelected: __SX1262_PA_LP / __SX126X_PA_HP
// rxTx: __SX126X_RXTX_OFF, __SX126X_RX, __SX126X_TX
// -----------------------------------------------------------------
__weak void _sx126x_rfSwitchSet(uint8_t paSelected, uint8_t rxTx) {

